[
  {
    "id": "online-teaching-jobs",
    "title": "Top 5 Online Teaching Jobs",
    "author": "Lakisha Delgado",
    "datePosted": "2024-08-18T04:43:11",
    "imageUrl": "http://placehold.it/800x400",
    "content": [
      {
        "subtitle": "Introduction",
        "text": "Online teaching is a booming field with plenty of opportunities for educators. This article highlights the top 5 online teaching jobs that offer flexibility and good pay."
      },
      {
        "subtitle": "Benefits of Online Teaching",
        "text": "Online teaching allows you to work from home, set your own schedule, and connect with students from around the world."
      },
      {
        "subtitle": "Top Online Teaching Platforms",
        "bulletPoints": [
          "VIPKid: Teach English online to Chinese students.",
          "Teachable: Create and sell your own online courses.",
          "K12: Work as a teacher for virtual K-12 schools.",
          "Outschool: Teach small group classes on any subject.",
          "Udemy: Develop courses on a wide variety of topics."
        ]
      }
    ]
  },
  {
    "id": "freelance-writing-jobs",
    "title": "How to Start Freelance Writing",
    "author": "Pauline Johns",
    "datePosted": "2024-08-18T04:43:11",
    "imageUrl": "http://placehold.it/800x400",
    "content": [
      {
        "subtitle": "Introduction",
        "text": "Freelance writing is a flexible and rewarding career that can be done from anywhere. This guide covers how to get started, find clients, and grow your writing business."
      },
      {
        "subtitle": "Finding Your Niche",
        "text": "Identify the types of writing you're passionate about, whether it's blogging, copywriting, or technical writing."
      },
      {
        "subtitle": "Building a Portfolio",
        "text": "Create a portfolio that showcases your best work. Include samples that reflect the kind of writing you want to be hired for."
      },
      {
        "subtitle": "Pitching to Clients",
        "text": "Learn how to craft compelling pitches that grab the attention of potential clients and land you the job."
      }
    ]
  }
]
